app/Controllers/AdminController.php

SELECT *
FROM `users`
WHERE `email` = 'test@gmail.com'
---
    public function createUserStore()
    {
        helper(['form']);

        $validation = \Config\Services::validation();

        $rules = [
            'name' => 'required|min_length[3]|max_length[255]',
            'email' => 'required|valid_email|max_length[255]',
            'password' => 'required|min_length[8]',
            'role' => 'required|in_list[admin,manager,employee]'
        ];

        if (!$this->validate($rules)) {
            return redirect()
                ->back()
                ->withInput()
                ->with('error', $validation->getErrors());
        }

        $db = \Config\Database::connect();

        // Check if email already exists
        $existingUser = $db->table('users')
            ->where('email', $this->request->getPost('email'))
            ->get()
            ->getRow();

INSERT INTO `users` (`name`, `email`, `password`, `role`, `is_active`, `created_at`, `updated_at`) VALUES ('test', 'test@gmail.com', '$2y$10$Ve1hmbIdBLlyR7lSwNWGU.D6lrZwWzDUdb7hRtyoHZS14BWFhNXlu', 'employee', 1, '2026-02-22 13:43:07', '2026-02-22 13:43:07')
---
        }

        // Insert user
        $db->table('users')->insert([
            'name'       => $this->request->getPost('name'),
            'email'      => $this->request->getPost('email'),
            'password'   => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
            'role'       => $this->request->getPost('role'),
            'is_active'  => 1,
            'created_at' => date('Y-m-d H:i:s'),
            'updated_at' => date('Y-m-d H:i:s'),
        ]);

SELECT *
FROM `teams`
WHERE `id` = '1'
SELECT `u`.`id`, `u`.`name`, `u`.`email`, `u`.`role`, `u`.`is_active`, `tm`.`joined_at`
FROM `team_members` `tm`
JOIN `users` `u` ON `u`.`id` = `tm`.`user_id`
WHERE `tm`.`team_id` = '1'
SELECT `u`.`id`, `u`.`name`, `u`.`email`, `u`.`role`, `u`.`is_active`
FROM `users` `u`
WHERE u.id NOT IN (
                         SELECT user_id 
                         FROM team_members 
                         WHERE team_id = 1
                     )
AND `u`.`id` != '1'
---
    public function teamMembers($team_id)
    {
        $db = \Config\Database::connect();

        // 1️⃣ Get team info (optional but recommended)
        $team = $db->table('teams')
                ->where('id', $team_id)
                ->get()
                ->getRowArray();

        if (!$team) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // 2️⃣ Get team members (join users + team_members)
        $members = $db->table('team_members tm')
                    ->select('u.id, u.name, u.email, u.role, u.is_active, tm.joined_at')
                    ->join('users u', 'u.id = tm.user_id')
                    ->where('tm.team_id', $team_id)
                    ->get()
                    ->getResultArray();

        $nonMembers = $db->table('users u')
                     ->select('u.id, u.name, u.email, u.role, u.is_active')
                     ->where("u.id NOT IN (
                         SELECT user_id
                         FROM team_members
                         WHERE team_id = " . (int)$team_id . "
                     )")
                     ->where('u.id !=' , session()->get('user')['id'])
                     ->get()
                     ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `teams`
WHERE `id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `team_members`
WHERE `team_id` = '1'
AND `user_id` = 5
INSERT INTO `team_members` (`team_id`, `user_id`, `joined_at`) VALUES ('1', 5, '2026-02-22')
---
    public function teamMembersAdd($team_id)
    {
        $db = \Config\Database::connect();

        $user_id = (int) $this->request->getPost('user_id');

        if (!$user_id) {
            return redirect()->back()->with('error', 'Invalid user selected.');
        }

        // 1️⃣ Check if team exists
        $teamExists = $db->table('teams')
                        ->where('id', $team_id)
                        ->countAllResults();

        if (!$teamExists) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // 2️⃣ Prevent duplicate insert
        $alreadyMember = $db->table('team_members')
                            ->where('team_id', $team_id)
                            ->where('user_id', $user_id)
                            ->countAllResults();

        if ($alreadyMember) {
            return redirect()->back()->with('error', 'User already in this team.');
        }

        // 3️⃣ Insert new team member
        $db->table('team_members')->insert([
            'team_id'   => $team_id,
            'user_id'   => $user_id,
            'joined_at' => date('Y-m-d')
        ]);