app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'sheetexavibes@gmail.com'
---
    public function login(): RedirectResponse
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()
                             ->withInput()
                             ->with('errors', $this->validator->getErrors());
        }

        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->db->table('users')
                         ->where('email', $email)
                         ->get()
                         ->getRowArray();