app/Controllers/ManagerController.php

SELECT DISTINCT `t`.*
FROM `teams` `t`
LEFT JOIN `team_members` `tm` ON `tm`.`team_id` = `t`.`id`
WHERE   (
`t`.`user_id` = '2'
OR `tm`.`user_id` = '2'
 )
---
    public function teamsListing()
    {
        $db = \Config\Database::connect();

        $user_id = session()->get('user')['id'];

        $teams = $db->table('teams t')
                    ->distinct()
                    ->select('t.*')
                    ->join('team_members tm', 'tm.team_id = t.id', 'left')
                    ->groupStart()
                        ->where('t.user_id', $user_id)
                        ->orWhere('tm.user_id', $user_id)
                    ->groupEnd()
                    ->get()
                    ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `team_members` `tm`
JOIN `users` `u` ON `u`.`id` = `tm`.`user_id`
WHERE `tm`.`team_id` = '3'
AND `tm`.`user_id` = '2'
AND `u`.`role` = 'manager'
SELECT *
FROM `teams`
WHERE `id` = '3'
SELECT `u`.`id`, `u`.`name`, `u`.`email`, `u`.`role`, `u`.`is_active`, `tm`.`joined_at`
FROM `team_members` `tm`
JOIN `users` `u` ON `u`.`id` = `tm`.`user_id`
WHERE `tm`.`team_id` = '3'
AND `u`.`role` = 'employee'
---
    public function teamsView($team_id)
    {
        $db = \Config\Database::connect();

        $user = session()->get('user');
        $user_id = $user['id'];

        // 1️⃣ Check if this user is a manager in this team
        $hasAccess = $db->table('team_members tm')
                        ->join('users u', 'u.id = tm.user_id')
                        ->where('tm.team_id', $team_id)
                        ->where('tm.user_id', $user_id)
                        ->where('u.role', 'manager')
                        ->countAllResults();

        if (!$hasAccess) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // 2️⃣ Get Team Details
        $team = $db->table('teams')
                ->where('id', $team_id)
                ->get()
                ->getRowArray();

        if (!$team) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound();
        }

        // 3️⃣ Get Employees in that team
        $employees = $db->table('team_members tm')
                        ->select('u.id, u.name, u.email, u.role, u.is_active, tm.joined_at')
                        ->join('users u', 'u.id = tm.user_id')
                        ->where('tm.team_id', $team_id)
                        ->where('u.role', 'employee')
                        ->get()
                        ->getResultArray();